package com.chenc.interview.ant_tuan;

/**
 * 小团和蚂蚁们成为了好朋友。蚂蚁们现在打算爬上一颗树做游戏，这一一个游戏的开始需
 * 要蚂蚁们组队之后商量战术。为了更好地交流，同一个队伍的蚂蚁们会站在树.上的同一个节
 * 点。不同队伍的蚂蚁们会间隔至少一个空的节点，这样的话它们同组交流战术时不会被其他
 * 组听到。而树上每一个节点可以容纳的蚂蚁数量是有限的。为了更好玩以及游戏性，蚂蚁们
 * 希望在参加蚂蚁数最多的前提下，使得蚂蚁数最少的队伍的蚂蚁数尽可能多。蚂蚁们不能很
 * 好地解决这个问题，希望小团帮忙解决。
 * 给定一棵树，每个节点有一个权值。选择其中某些节点，满足被选中的节点两两不相
 * 邻。求在所有的选择方案中，最大化被选择节点权值之和的情况下，被选择节点权值最小值
 * 尽可能大。树是一种无向联通图，任意节点两两可达且无环。
 * 
 * @author cc
 * @since 2022.3.3
 */
public class Solution {

    public int answer(int num_nodes, int num_edges, int[] weight, int[] left, int[] right) {
        
        
        return 0;
    }

    public static void main(String[] args) {

    }
}
